users = {
	"Курушин" : {
		"hash": "478f8397fe60993a02db85d5a0cbfcd17068f234e072a43b0f27dd9a",
		"ФИО": "Курушин Даниил Сергеевич",
		"степень": "кандидат технических наук",
		"должность": "доцент",
		"штатный": "да",
		"место работы": "кафедра ИТАС"
	}
	"Файзрахманов" : {
		"hash": "478f8397fe60993a02db85d5a0cbfcd17068f234e072a43b0f27dd9a",
		"ФИО": "Файзрахманов Рустам Абубакирович",
		"степень": "доктор экономических наук",
		"должность": "Заведующий кафедрой",
		"штатный": "да",
		"место работы": "кафедра ИТАС",
		"ученое звание": "Профессор",
	}
	"Петренко" : {
		"hash": "478f8397fe60993a02db85d5a0cbfcd17068f234e072a43b0f27dd9a",
		"ФИО": "Петренко Александр Анатольевич",
		"должность": "доцент",
		"степень": "кандидат технических наук",
		"штатный": "да",
		"место работы": "кафедра ИТАС"
	}
}

def calc_hash(_str = ""):
	import hashlib
	return hashlib.sha224(_str.encode('utf-8')).hexdigest()
